//      Напишите программу, которая посчитает количество смайликов в заданном тексте.
//        Смайликом будем считать последовательность символов, удовлетворяющую условиям:
//        ■ первым символом является либо ; (точка с запятой) либо : (двоеточие) ровно один раз;
//        ■ далее может идти символ – (минус) сколько угодно раз (в том числе символ минус может идти ноль раз);
//        ■ в конце обязательно идет некоторое количество (не меньше одной) одинаковых скобок из следующего набора: (, ), [, ];
//        ■ внутри смайлика не может встречаться никаких других символов.
//        Например, нижеприведенные последовательности явля- ются смайликами:
//        :) ;---------[[[[[[[[
//        в то время как нижеследующие последовательности смайликами не являются (хотя некоторые из них содержат смайлики):
//        :-)] ;-- -) ::-( :-()

import java.util.Arrays;

public class Task12 {
    public static void main(String[] args) {
        String str = ":) dfgsd sdfg sdgf ;---------[[[[[[[ sgffg ::-( fgdsfg':-()";
        String[] stringsStr = str.split(str, ' ');

        System.out.println(Arrays.toString(stringsStr));
    }
}
